20210907012153-org_mode.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>org-mode</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">org-mode</h1>
<div id="outline-container-orgc3bcd6d" class="outline-2">
<h2 id="orgc3bcd6d"><a href="#orgc3bcd6d">概要</a></h2>
<div class="outline-text-2" id="text-orgc3bcd6d">
<p>
org-modeは<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>の機能の1つ。独自のアウトライン形式.orgを扱うためのインターフェースを提供する。Emacsのkiller appの一角で、根強い人気がある。
</p>

<ul class="org-ul">
<li>キーボードにフォーカスしたアウトライン操作</li>
<li>プロジェクト管理</li>
<li>時間計測</li>
<li>脚注</li>
<li>PDF、HTMLなどの各種形式への変換(<a href="index.html#ID-2709c815-cd38-4679-86e8-ff2d3b8817e4">Insomnia</a>はこの変換を使ってビルドしている)</li>
<li>コードの実行、実行結果の文書内への挿入</li>
<li>シンタックスハイライト</li>
<li>タグを使用した検索</li>
</ul>

<p>
などが可能。
</p>
</div>
</div>
<div id="outline-container-orgdaa6a9c" class="outline-2">
<h2 id="orgdaa6a9c"><a href="#orgdaa6a9c">Memo</a></h2>
<div class="outline-text-2" id="text-orgdaa6a9c">
</div>
<div id="outline-container-org2eee348" class="outline-3">
<h3 id="org2eee348"><a href="#org2eee348">pandocでディレクトリ内のorgファイルを1つのPDFにする</a></h3>
<div class="outline-text-3" id="text-org2eee348">
<ul class="org-ul">
<li><a href="https://zenn.dev/honahuku/scraps/bb784d54600256">ubuntuでpandocを使ったmarkdownのpdf作成</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">sudo apt install pandoc texlive-lang-japanese texlive-latex-extra texlive-luatex
sudo apt install librsvg2-bin <span class="org-comment-delimiter"># </span><span class="org-comment">SVG</span>
pandoc -s test.org -o te2st.pdf --pdf-engine=lualatex -V <span class="org-variable-name">documentclass</span>=ltjsarticle -V <span class="org-variable-name">luatexjapresetoptions</span>=morisawa
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>ディレクトリ下を一括で実行する</label><pre class="src src-shell">mkdir -p pdf
find ./ -name <span class="org-string">"*.org"</span> -type f -exec sh -c <span class="org-string">'echo ${0}; pandoc "${0}" -o "pdf/${0%.org}.pdf" --toc -N --pdf-engine=lualatex -V documentclass=ltjsarticle -V luatexjapresetoptions=morisawa &amp;&amp; echo ok'</span> {} <span class="org-string">\;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>結合する</label><pre class="src src-shell">sudo apt install pdftk
pdftk *.pdf cat output merge.pdf
</pre>
</div>
</div>
</div>

<div id="outline-container-org5adc60c" class="outline-3">
<h3 id="org5adc60c"><a href="#org5adc60c">見積もり時間</a></h3>
<div class="outline-text-3" id="text-org5adc60c">
<p>
<code>C-c C-x e</code> で見積もり時間を設定できる。見積もり時間を設定すると、モードラインの残り時間の横に表示される。[0:51/03:00]という感じ。
</p>
</div>
</div>
<div id="outline-container-org24ae560" class="outline-3">
<h3 id="org24ae560"><a href="#org24ae560">easy templates</a></h3>
<div class="outline-text-3" id="text-org24ae560">
<ul class="org-ul">
<li><code>&lt;q tag</code> でquote blockを展開できる</li>
<li>&lt;s tag でsource code blockを展開できる</li>
</ul>
</div>
</div>
<div id="outline-container-org6594f58" class="outline-3">
<h3 id="org6594f58"><a href="#org6594f58">orgエレメントの情報を取得する</a></h3>
<div class="outline-text-3" id="text-org6594f58">
<p>
org-modeをパースした結果が保持されているので、APIによって簡単に扱うことができる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>細かい情報を取得できる</label><pre class="src src-emacs-lisp">(org-element-context)
</pre>
</div>

<div class="results" id="org031afa1">
<p>
(src-block (:language emacs-lisp :switches nil :parameters :results raw :begin 530 :end 622 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value (org-element-context)
 :post-blank 1 :post-affiliated 553 :caption (((細かい情報を取得できる))) :parent nil))
</p>

</div>

<p>
org-modeが各エレメントをどのように扱っているか少し想像がつく。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>アクセスして取得する用の関数もある</label><pre class="src src-emacs-lisp">(org-element-type (org-element-context))
</pre>
</div>

<div class="results" id="org0186299">
<p>
src-block
</p>

</div>
</div>
</div>

<div id="outline-container-orga57f8a8" class="outline-3">
<h3 id="orga57f8a8"><a href="#orga57f8a8">orgファイルからkeywordsを取得する</a></h3>
<div class="outline-text-3" id="text-orga57f8a8">
<p>
(org-collect-keywords)を使うとorgファイルの情報を取得できる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>(org-collect-keywords)を使ってタイトルを取得しているコード例</label><pre class="src src-git-permalink">https://github.com/kd-collective/org-roam/blob/abe63b436035049923ae96639b9b856697047779/org-roam-db.el#L299-L309
</pre>
</div>

<div class="results" id="org796cd2d">
<p>
(defun org-roam-db&#x2013;file-title ()
  &ldquo;In current Org buffer, get the title.
If there is no title, return the file name relative to
`org-roam-directory&rsquo;.&rdquo;
  (org-link-display-format
   (or (cadr (assoc &ldquo;TITLE&rdquo; (org-collect-keywords &rsquo;(&ldquo;title&rdquo;))))
       (file-name-sans-extension (file-relative-name
                                  (buffer-file-name (buffer-base-buffer))
                                  org-roam-directory)))))
</p>

<p>
(defun org-roam-db-insert-file ()
</p>

</div>
</div>
</div>

<div id="outline-container-org4243502" class="outline-3">
<h3 id="org4243502"><a href="#org4243502">メモをつける</a></h3>
<div class="outline-text-3" id="text-org4243502">
<p>
タスクの状態が遷移したときに、メモを開く設定ができる。
</p>

<pre class="example">
:PROPERTIES:
:LOGGING:  lognoterepeat
:END:
</pre>
</div>
</div>
<div id="outline-container-org1207089" class="outline-3">
<h3 id="org1207089"><a href="#org1207089">プロパティ挿入</a></h3>
<div class="outline-text-3" id="text-org1207089">
<p>
特殊な意味をもつ、大文字で構成されるさまざまなプロパティが存在する。
EXPORTシリーズ、CUSTOM_ID、ID&#x2026;。
</p>

<p>
C-c C-x p で挿入できる。
</p>
</div>
</div>
<div id="outline-container-orge948455" class="outline-3">
<h3 id="orge948455"><a href="#orge948455">直前のタスクで再度計測</a></h3>
<div class="outline-text-3" id="text-orge948455">
<p>
C-c C-x C-i (org-clock-in) でタスク計測できる。
</p>

<p>
直前のタスクで再度計測するときは、 C-c C-x C-x (org-clock-in-last) で可能。
<a href="https://orgmode.org/manual/Clocking-commands.html">https://orgmode.org/manual/Clocking-commands.html</a>
</p>

<p>
clock-inが動くだけで、org-pomodoroはinvokeしない。
</p>
</div>
</div>
<div id="outline-container-orgbd33b26" class="outline-3">
<h3 id="orgbd33b26"><a href="#orgbd33b26">見出しのリンクを挿入する</a></h3>
<div class="outline-text-3" id="text-orgbd33b26">
<p>
<a href="20210508233810-org_roam.html#ID-815a2c31-7ddb-40ad-bae0-f84e1cfd8de1">Org-roam</a>で見出しへのファイル内リンクを貼りたいとき。
</p>

<p>
<code>org-store-link (C-c l)</code>
で、見出しのリンクを取得する。このとき見出しのIDが生成される。これを消すと辿れなくなるので注意。
</p>

<p>
<code>org-insert-link (C-c C-l)</code>
で、貼り付ける。
</p>
</div>
</div>
<div id="outline-container-org861fe05" class="outline-3">
<h3 id="org861fe05"><a href="#org861fe05">タグをつける</a></h3>
<div class="outline-text-3" id="text-org861fe05">
<p>
<code>C-c C-c</code> で見出しにタグを挿入できる。
WIPとかつけるようにすると便利そう。
基本的なカテゴリは階層で、一時的な状態はタグでやるようにするのがよさそう。
</p>

<p>
<code>C-c / m</code> で検索できる。
</p>
</div>
</div>
<div id="outline-container-org2624543" class="outline-3">
<h3 id="org2624543"><a href="#org2624543">可変幅と等幅フォント</a></h3>
<div class="outline-text-3" id="text-org2624543">
<p>
<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>はテキストエディタなので、文字表示のほとんどは等幅フォントだ。が、
org-modeでは自然言語の文章なので、幅の違うフォントのほうが読みやすい。
</p>

<p>
<a href="https://zzamboni.org/post/beautifying-org-mode-in-emacs/">zzamboni.org | Beautifying Org Mode in Emacs</a>の設定がとても良い。
</p>

<ul class="org-ul">
<li>M-qでインデントの形に文章を整形する</li>
<li>variable-pitch-modeが可変幅にするmode</li>
<li>variable-pitch-modeだけだとコードブロックも可変になっちゃうので、コードブロックなどのfaceも変更する</li>
</ul>
</div>
</div>
<div id="outline-container-org0a9faf8" class="outline-3">
<h3 id="org0a9faf8"><a href="#org0a9faf8">org-alertで通知する</a></h3>
<div class="outline-text-3" id="text-org0a9faf8">
<p>
<a href="https://github.com/spegoraro/org-alert">spegoraro/org-alert: System notifications of org agenda items</a>
org-alertでDEADLINEが近い見出しを通知できる。
期限設定していても、通知されなければ忘れる。
スケジュール管理に使うのであれば必須か。
</p>
</div>
</div>
<div id="outline-container-orgf9bb833" class="outline-3">
<h3 id="orgf9bb833"><a href="#orgf9bb833">babelのヘッダーを挿入する</a></h3>
<div class="outline-text-3" id="text-orgf9bb833">
<p>
ヘッダーでbabelの実行結果のオプションを変えることができる。
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-block-begin-line">#+BEGIN_SRC emacs-lisp :result outputs</span>
<span class="org-org-block">(concat </span><span class="org-org-block"><span class="org-string">"hello"</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"world"</span></span><span class="org-org-block">)</span>
<span class="org-org-block-end-line">#+END_SRC</span>
</pre>
</div>

<p>
で実行すると標準出力が挿入される。
</p>

<p>
手書きは忘れやすいのでコマンドでやる。
コードブロック上で <code>C-c C-v j</code> :: <code>org-babel-insert-header-arg</code> 。
</p>

<p>
わかりやすい説明。
<a href="http://misohena.jp/blog/2017-10-26-how-to-use-code-block-of-emacs-org-mode.html">org-modeのコードブロック(Babel)の使い方 | Misohena Blog</a>
</p>
</div>
</div>
<div id="outline-container-orgbe49ee6" class="outline-3">
<h3 id="orgbe49ee6"><a href="#orgbe49ee6">babelで結果をそのまま表示する</a></h3>
<div class="outline-text-3" id="text-orgbe49ee6">
<p>
適用させたい見出しレベルのproperty内で、↓追加する。
</p>
<div class="org-src-container">
<pre class="src src-shell">:header-args+: :results output
</pre>
</div>

<p>
動作の違い。
</p>

<div class="org-src-container">
<pre class="src src-ruby">[1, 2]
</pre>
</div>

<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-ruby"><span class="org-builtin">p</span> [1, 2]
</pre>
</div>

<pre class="example">
[1, 2]
</pre>
</div>
</div>

<div id="outline-container-orga931bf4" class="outline-3">
<h3 id="orga931bf4"><a href="#orga931bf4">org-protocolを設定する</a></h3>
<div class="outline-text-3" id="text-orga931bf4">
<ul class="org-ul">
<li><a href="https://github.com/sprig/org-capture-extension">sprig/org-capture-extension: A Chrome and firefox extension facilitating org-capture in emacs</a></li>
</ul>
<p>
Chrome拡張としてある。ここのReadmeに書いてあるコマンドを実行する。
</p>
<ul class="org-ul">
<li>emacsclientをorg-protocolのハンドラとして登録する。たぶんプロトコルと対応するアプリケーションを選ぶ、という処理だろう。httpのときはブラウザを起動する、みたいな</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">cat &gt; <span class="org-string">"${HOME}/.local/share/applications/org-protocol.desktop"</span> &lt;&lt; EOF
<span class="org-sh-heredoc">[Desktop Entry]</span>
<span class="org-sh-heredoc">Name=org-protocol</span>
<span class="org-sh-heredoc">Exec=emacsclient %u</span>
<span class="org-sh-heredoc">Type=Application</span>
<span class="org-sh-heredoc">Terminal=false</span>
<span class="org-sh-heredoc">Categories=System;</span>
<span class="org-sh-heredoc">MimeType=x-scheme-handler/org-protocol;</span>
<span class="org-sh-heredoc">EOF</span>
</pre>
</div>

<p>
そして↓。Linux MintでもOKだった。
</p>

<div class="org-src-container">
<pre class="src src-shell">update-desktop-database ~/.local/share/applications/
</pre>
</div>

<p>
OSの設定は完了。Emacsの設定を追加する。template名をちゃんと設定する+ディレクトリが存在しないと起動しない。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-capture-templates `(
    (<span class="org-string">"p"</span> <span class="org-string">"Protocol"</span> entry (file+headline ,(concat org-directory <span class="org-string">"notes.org"</span>) <span class="org-string">"Inbox"</span>)
        <span class="org-string">"* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?"</span>)
    (<span class="org-string">"L"</span> <span class="org-string">"Protocol Link"</span> entry (file+headline ,(concat org-directory <span class="org-string">"notes.org"</span>) <span class="org-string">"Inbox"</span>)
        <span class="org-string">"* %? [[%:link][%:description]] \nCaptured On: %U"</span>)
))
</pre>
</div>

<p>
Chromeに拡張機能をインストールしてクリックすると、Emacsが立ち上がる。
</p>
</div>
</div>
<div id="outline-container-org2bbab2c" class="outline-3">
<h3 id="org2bbab2c"><a href="#org2bbab2c">org-protocolでプロンプトを出さないようにする</a></h3>
<div class="outline-text-3" id="text-org2bbab2c">
<p>
Linux Mint, Chromeにて。
org-protocolを設定できても、ドメインごとでxdg-openを許可しますかプロンプトが出るので面倒。
ポリシーを変更することで出さないようにする。
</p>

<p>
設定ポリシーは、chrome://policy/ で確認できる。最初は何もない。
↓実行する。
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>ポリシーを追加する</label><pre class="src src-shell">sudo mkdir -p /etc/opt/chrome/policies/managed/ &amp;&amp; <span class="org-builtin">echo</span> <span class="org-string">'{ "URLAllowlist": ["org-protocol://*"] }'</span> |sudo tee /etc/opt/chrome/policies/managed/whitelist.json
</pre>
</div>

<p>
chrome://policy/ に表示されるのを確認する(再読込が必要)。
org-protocol使用時にプロンプトが出なくなる。
</p>
</div>
</div>
<div id="outline-container-org59bb09f" class="outline-3">
<h3 id="org59bb09f"><a href="#org59bb09f">メモを取るのにはorg-captureを使う</a></h3>
</div>
<div id="outline-container-org4b20bad" class="outline-3">
<h3 id="org4b20bad"><a href="#org4b20bad">エクスポートしないタグ</a></h3>
<div class="outline-text-3" id="text-org4b20bad">
<p>
<code>C-c C-q</code> で <code>noexport</code> を指定するとその場所はエクスポートされない。
</p>
</div>
</div>
</div>
<div id="outline-container-orga392d1c" class="outline-2">
<h2 id="orga392d1c"><a href="#orga392d1c">Tasks</a></h2>
<div class="outline-text-2" id="text-orga392d1c">
</div>
<div id="outline-container-orgb285238" class="outline-3">
<h3 id="orgb285238"><a href="#orgb285238"><span class="todo TODO">TODO</span> org-lintをCIで実行する</a></h3>
<div class="outline-text-3" id="text-orgb285238">
<p>
<code>org-lint</code> をディレクトリに対して行う方法。
</p>
</div>
</div>
<div id="outline-container-org3022473" class="outline-3">
<h3 id="org3022473"><a href="#org3022473"><span class="todo TODO">TODO</span> ファイルごとの形式を正規化する</a></h3>
<div class="outline-text-3" id="text-org3022473">
<p>
見出しにけっこうズレがある。そういうのを検知するLintがあるはずだ。
</p>
</div>
</div>
<div id="outline-container-orgaed2d20" class="outline-3">
<h3 id="orgaed2d20"><a href="#orgaed2d20"><span class="todo TODO">TODO</span> clock table/agenda にリンクをつける</a></h3>
</div>
</div>
<div id="outline-container-org534d9f7" class="outline-2">
<h2 id="org534d9f7"><a href="#org534d9f7">Example</a></h2>
<div class="outline-text-2" id="text-org534d9f7">
</div>
<div id="outline-container-org2a87ac3" class="outline-3">
<h3 id="org2a87ac3"><a href="#org2a87ac3">チェックリスト</a></h3>
<div class="outline-text-3" id="text-org2a87ac3">
<p>
<code>C-c</code> でチェックできる。
</p>
<ul class="org-ul">
<li>人としてやるべきこと <code>[1/3]</code>
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 盆栽に水をやる</li>
<li class="off"><input type='checkbox' /> 子孫に美田を残す</li>
<li class="off"><input type='checkbox' /> 借金を返す</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgef8dbe8" class="outline-3">
<h3 id="orgef8dbe8"><a href="#orgef8dbe8">脚注</a></h3>
<div class="outline-text-3" id="text-orgef8dbe8">
<p>
これが脚注<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>である。
定義はどこに書いてもいい。
出力時にはFootnotesのアウトラインが作られてそこに挿入される。
</p>
</div>
</div>
</div>
<div id="outline-container-org44eb327" class="outline-2">
<h2 id="org44eb327"><a href="#org44eb327">Reference</a></h2>
<div class="outline-text-2" id="text-org44eb327">
</div>
<div id="outline-container-org068f6bc" class="outline-3">
<h3 id="org068f6bc"><a href="#org068f6bc"><a href="https://www.evalapply.org/posts/why-and-how-i-use-org-mode/index.html">Why and How I use &ldquo;Org Mode&rdquo; for my writing and more</a></a></h3>
<div class="outline-text-3" id="text-org068f6bc">
<p>
org-modeを使う理由。
</p>
</div>
</div>
<div id="outline-container-orga5db405" class="outline-3">
<h3 id="orga5db405"><a href="#orga5db405"><a href="https://zzamboni.org/post/beautifying-org-mode-in-emacs/">zzamboni.org | Beautifying Org Mode in Emacs</a></a></h3>
<div class="outline-text-3" id="text-orga5db405">
<p>
かなりいい感じに表示する設定。
</p>
</div>
</div>
<div id="outline-container-orgefc1f54" class="outline-3">
<h3 id="orgefc1f54"><a href="#orgefc1f54"><a href="https://orgmode.org/manual/Results-of-Evaluation.html">Results of Evaluation (The Org Manual)</a></a></h3>
</div>
<div id="outline-container-org92bafc2" class="outline-3">
<h3 id="org92bafc2"><a href="#org92bafc2"><a href="https://lists.gnu.org/archive/html/emacs-orgmode/2017-10/msg00227.html">Re: [O] Lint multiple files at once</a></a></h3>
</div>
<div id="outline-container-org63bd7a3" class="outline-3">
<h3 id="org63bd7a3"><a href="#org63bd7a3"><a href="https://blog.jethro.dev/posts/org_mode_workflow_preview/">Org-mode Workflow: A Preview · Jethro Kuan</a></a></h3>
<div class="outline-text-3" id="text-org63bd7a3">
<p>
org-mode運用法。
</p>
</div>
</div>
<div id="outline-container-org17d471c" class="outline-3">
<h3 id="org17d471c"><a href="#org17d471c"><a href="https://github.com/sprig/org-capture-extension">sprig/org-capture-extension: A Chrome and firefox extension facilitating org-capture in emacs</a></a></h3>
<div class="outline-text-3" id="text-org17d471c">
<p>
org-protocolの設定。
</p>
</div>
</div>
</div>
<div id="outline-container-orge851d26" class="outline-2">
<h2 id="orge851d26"><a href="#orge851d26">Archives</a></h2>
<div class="outline-text-2" id="text-orge851d26">
</div>
<div id="outline-container-orgb02da9b" class="outline-3">
<h3 id="orgb02da9b"><a href="#orgb02da9b"><span class="done CLOSE">CLOSE</span> exampleを完成させる</a></h3>
<div class="outline-text-3" id="text-orgb02da9b">
<p>
どういう意味なのか、全く思い出せない。
ああ、org-modeの使用例のページを作るということか。
別にいらないだろう。実際の例で示せばいい。
</p>
</div>
</div>
<div id="outline-container-orgffc8303" class="outline-3">
<h3 id="orgffc8303"><a href="#orgffc8303"><span class="done DONE">DONE</span> org-captureでメモ元リンクを記録しないようにする</a></h3>
<div class="outline-text-3" id="text-orgffc8303">
</div>
</div>
<div id="outline-container-org4adf29f" class="outline-3">
<h3 id="org4adf29f"><a href="#org4adf29f"><span class="done CLOSE">CLOSE</span> org-pomodoro完了後メモを残すように設定を復活</a></h3>
<div class="outline-text-3" id="text-org4adf29f">
<p>
別に見ないから不要だろう。
</p>
</div>
</div>
<div id="outline-container-org9d52964" class="outline-3">
<h3 id="org9d52964"><a href="#org9d52964"><span class="done DONE">DONE</span> denoteを調べる</a></h3>
<div class="outline-text-3" id="text-org9d52964">
<ul class="org-ul">
<li><a href="https://protesilaos.com/codelog/2022-06-18-denote-demo/">Emacs: demonstration of my Denote package (simple note-taking) | Protesilaos Stavrou</a></li>
</ul>

<p>
roamだと時系列、ブログ的に表現しにくいので、denoteを調べる。ほとんどは分野別ファイルで問題ないが、たまに必要なときがある。いい感じだ。
</p>

<p>
denoteリンクをHTMLエクスポートする方法がわからない。エラーになる。
リネームするときは denote-rename-file を使う。
</p>
</div>
</div>
<div id="outline-container-org7981bb5" class="outline-3">
<h3 id="org7981bb5"><a href="#org7981bb5"><span class="done DONE">DONE</span> Agenda Viewの整理</a></h3>
<div class="outline-text-3" id="text-org7981bb5">
<p>
予定関係をうまく使えてない。
</p>

<ul class="org-ul">
<li>effort表示をorg-agendaでできるようにした
<ul class="org-ul">
<li>目標値だけで、今どれくらいやったのかはわからないのが若干ビミョーだが&#x2026;</li>
</ul></li>
<li>週タスクを決めるためのビュー
<ul class="org-ul">
<li>TODO一覧を見る</li>
<li>今週やると決めたものにeffortを設定する</li>
</ul></li>
<li>今日(週)やることのビュー
<ul class="org-ul">
<li>週のscheduleの一覧が表示される</li>
<li>今日やることをWIPにして開始</li>
<li>2つ表示しようとしたが、面倒だったのでやめた</li>
<li>scheduledがうまく設定できず。まああまり先に設定してもやらないので、まあやらなくていい。せいぜい今週がわかればいい</li>
<li>effortでのフィルタはできたので、週にやりたいものはeffortを設定することにする</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
The link is: <a href="https://orgmode.org">https://orgmode.org</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
